data/cfdb/validation/turbulent_channel_retau180/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// Bulk velocity target; meanVelocityForce (system/fvOptions) keeps the
// domain-averaged streamwise velocity at Ubar = 1 m/s.
internalField   uniform (1 0 0);

boundaryField
{
    "(bottom|top)"
    {
        type            noSlip;
    }

    "(inlet|outlet|front|back)"
    {
        type            cyclic;
    }
}

// ************************************************************************* //
