data/cfdb/validation/turbulent_channel_retau180/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    // Low-Re wall treatment (first cell center y+ ~ 1): nut -> 0 at the wall.
    "(bottom|top)"
    {
        type            nutLowReWallFunction;
        value           $internalField;
    }

    "(inlet|outlet|front|back)"
    {
        type            cyclic;
    }
}

// ************************************************************************* //
