data/cfdb/validation/turbulent_channel_retau180/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

// Steady SIMPLE iterations. residualControl in system/fvSolution stops the
// run earlier once p/U/k/omega residuals drop below the stated levels.
endTime         4000;

deltaT          1;

writeControl    timeStep;

writeInterval   2000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;

functions
{
    // Writes the wallShearStress field on both walls at write times.
    // QoI extraction: area-average the x-component magnitude of
    // wallShearStress over bottom (and top, symmetric) at the final
    // iteration, then Cf = mean(|tau_w,x|) / (0.5 * rho * U_b^2) with
    // rho = 1 (incompressible) and U_b = 1 m/s -> Cf = 2 * mean(|tau_w,x|).
    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        writeFields     yes;
        patches         (bottom top);
        executeControl  writeTime;
        writeControl    writeTime;
    }

    // Writes y+ on the walls at write times (documentation of the low-Re
    // near-wall resolution actually achieved by the run).
    yPlus1
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        writeFields     yes;
        executeControl  writeTime;
        writeControl    writeTime;
    }
}

// ************************************************************************* //
